soburi/zephyr/drivers/clock_control/clock_control_gd32.h
/* SPDX-License-Identifier: BSD-3-Clause */

/*
 * Copyright (c) 2019 GigaDevice Semiconductor Inc.
 * Copyright (c) 2021 Tokita, Hiroshi <tokita.hiroshi@gmail.com>
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 *  1. Redistributions of source code must retain the above copyright notice, this
 *     list of conditions and the following disclaimer.
 *  2. Redistributions in binary form must reproduce the above copyright notice,
 *     this list of conditions and the following disclaimer in the documentation
 *     and/or other materials provided with the distribution.
 *  3. Neither the name of the copyright holder nor the names of its contributors
 *     may be used to endorse or promote products derived from this software without
 *     specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
 * IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
 * INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
 * NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
 * PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
 * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
 * OF SUCH DAMAGE.
 */

#ifndef ZEPHYR_DRIVERS_CLOCK_CONTROL_GD32_CLOCK_CONTROL_H_
#define ZEPHYR_DRIVERS_CLOCK_CONTROL_GD32_CLOCK_CONTROL_H_

/* RCU definitions */
#define RCU                             RCU_BASE

/* registers definitions */

#define RCU_CTL                         REG32(RCU + 0x00U)              /*!< control register */
#define RCU_CFG0                        REG32(RCU + 0x04U)              /*!< clock configuration register 0 */
#define RCU_INT                         REG32(RCU + 0x08U)              /*!< clock interrupt register */
#define RCU_APB2RST                     REG32(RCU + 0x0CU)              /*!< APB2 reset register */
#define RCU_APB1RST                     REG32(RCU + 0x10U)              /*!< APB1 reset register */
#define RCU_AHBEN                       REG32(RCU + 0x14U)              /*!< AHB1 enable register */
#define RCU_APB2EN                      REG32(RCU + 0x18U)              /*!< APB2 enable register */
#define RCU_APB1EN                      REG32(RCU + 0x1CU)              /*!< APB1 enable register */
#define RCU_BDCTL                       REG32(RCU + 0x20U)              /*!< backup domain control register */
#define RCU_RSTSCK                      REG32(RCU + 0x24U)              /*!< reset source / clock register */
#define RCU_AHBRST                      REG32(RCU + 0x28U)              /*!< AHB reset register */
#define RCU_CFG1                        REG32(RCU + 0x2CU)              /*!< clock configuration register 1 */
#define RCU_DSV                         REG32(RCU + 0x34U)              /*!< deep-sleep mode voltage register */


/* bits definitions */
/* RCU_CTL */
#define RCU_CTL_IRC8MEN                 BIT(0)                          /*!< internal high speed oscillator enable */
#define RCU_CTL_IRC8MSTB                BIT(1)                          /*!< IRC8M high speed internal oscillator stabilization flag */
#define RCU_CTL_IRC8MADJ                BITS(3, 7)                      /*!< high speed internal oscillator clock trim adjust value */
#define RCU_CTL_IRC8MCALIB              BITS(8, 15)                     /*!< high speed internal oscillator calibration value register */
#define RCU_CTL_HXTALEN                 BIT(16)                         /*!< external high speed oscillator enable */
#define RCU_CTL_HXTALSTB                BIT(17)                         /*!< external crystal oscillator clock stabilization flag */
#define RCU_CTL_HXTALBPS                BIT(18)                         /*!< external crystal oscillator clock bypass mode enable */
#define RCU_CTL_CKMEN                   BIT(19)                         /*!< HXTAL clock monitor enable */
#define RCU_CTL_PLLEN                   BIT(24)                         /*!< PLL enable */
#define RCU_CTL_PLLSTB                  BIT(25)                         /*!< PLL clock stabilization flag */
#define RCU_CTL_PLL1EN                  BIT(26)                         /*!< PLL1 enable */
#define RCU_CTL_PLL1STB                 BIT(27)                         /*!< PLL1 clock stabilization flag */
#define RCU_CTL_PLL2EN                  BIT(28)                         /*!< PLL2 enable */
#define RCU_CTL_PLL2STB                 BIT(29)                         /*!< PLL2 clock stabilization flag */


#define RCU_CFG0_SCS                    BITS(0, 1)                      /*!< system clock switch */
#define RCU_CFG0_SCSS                   BITS(2, 3)                      /*!< system clock switch status */
#define RCU_CFG0_AHBPSC                 BITS(4, 7)                      /*!< AHB prescaler selection */
#define RCU_CFG0_APB1PSC                BITS(8, 10)                     /*!< APB1 prescaler selection */
#define RCU_CFG0_APB2PSC                BITS(11, 13)                    /*!< APB2 prescaler selection */
#define RCU_CFG0_ADCPSC                 BITS(14, 15)                    /*!< ADC prescaler selection */
#define RCU_CFG0_PLLSEL                 BIT(16)                         /*!< PLL clock source selection */
#define RCU_CFG0_PREDV0_LSB             BIT(17)                         /*!< the LSB of PREDV0 division factor */
#define RCU_CFG0_PLLMF                  BITS(18, 21)                    /*!< PLL clock multiplication factor */
#define RCU_CFG0_USBFSPSC               BITS(22, 23)                    /*!< USBFS clock prescaler selection */
#define RCU_CFG0_CKOUT0SEL              BITS(24, 27)                    /*!< CKOUT0 clock source selection */
#define RCU_CFG0_ADCPSC_2               BIT(28)                         /*!< bit 2 of ADCPSC */
#define RCU_CFG0_PLLMF_4                BIT(29)                         /*!< bit 4 of PLLMF */

/* RCU_INT */
#define RCU_INT_IRC40KSTBIF             BIT(0)                          /*!< IRC40K stabilization interrupt flag */
#define RCU_INT_LXTALSTBIF              BIT(1)                          /*!< LXTAL stabilization interrupt flag */
#define RCU_INT_IRC8MSTBIF              BIT(2)                          /*!< IRC8M stabilization interrupt flag */
#define RCU_INT_HXTALSTBIF              BIT(3)                          /*!< HXTAL stabilization interrupt flag */
#define RCU_INT_PLLSTBIF                BIT(4)                          /*!< PLL stabilization interrupt flag */
#define RCU_INT_PLL1STBIF               BIT(5)                          /*!< PLL1 stabilization interrupt flag */
#define RCU_INT_PLL2STBIF               BIT(6)                          /*!< PLL2 stabilization interrupt flag */
#define RCU_INT_CKMIF                   BIT(7)                          /*!< HXTAL clock stuck interrupt flag */
#define RCU_INT_IRC40KSTBIE             BIT(8)                          /*!< IRC40K stabilization interrupt enable */
#define RCU_INT_LXTALSTBIE              BIT(9)                          /*!< LXTAL stabilization interrupt enable */
#define RCU_INT_IRC8MSTBIE              BIT(10)                         /*!< IRC8M stabilization interrupt enable */
#define RCU_INT_HXTALSTBIE              BIT(11)                         /*!< HXTAL stabilization interrupt enable */
#define RCU_INT_PLLSTBIE                BIT(12)                         /*!< PLL stabilization interrupt enable */
#define RCU_INT_PLL1STBIE               BIT(13)                         /*!< PLL1 stabilization interrupt enable */
#define RCU_INT_PLL2STBIE               BIT(14)                         /*!< PLL2 stabilization interrupt enable */
#define RCU_INT_IRC40KSTBIC             BIT(16)                         /*!< IRC40K stabilization interrupt clear */
#define RCU_INT_LXTALSTBIC              BIT(17)                         /*!< LXTAL stabilization interrupt clear */
#define RCU_INT_IRC8MSTBIC              BIT(18)                         /*!< IRC8M stabilization interrupt clear */
#define RCU_INT_HXTALSTBIC              BIT(19)                         /*!< HXTAL stabilization interrupt clear */
#define RCU_INT_PLLSTBIC                BIT(20)                         /*!< PLL stabilization interrupt clear */
#define RCU_INT_PLL1STBIC               BIT(21)                         /*!< PLL1 stabilization interrupt clear */
#define RCU_INT_PLL2STBIC               BIT(22)                         /*!< PLL2 stabilization interrupt clear */
#define RCU_INT_CKMIC                   BIT(23)                         /*!< HXTAL clock stuck interrupt clear */

/* RCU_APB2RST */
#define RCU_APB2RST_AFRST               BIT(0)                          /*!< alternate function I/O reset */
#define RCU_APB2RST_PARST               BIT(2)                          /*!< GPIO port A reset */
#define RCU_APB2RST_PBRST               BIT(3)                          /*!< GPIO port B reset */
#define RCU_APB2RST_PCRST               BIT(4)                          /*!< GPIO port C reset */
#define RCU_APB2RST_PDRST               BIT(5)                          /*!< GPIO port D reset */
#define RCU_APB2RST_PERST               BIT(6)                          /*!< GPIO port E reset */
#define RCU_APB2RST_ADC0RST             BIT(9)                          /*!< ADC0 reset */
#define RCU_APB2RST_ADC1RST             BIT(10)                         /*!< ADC1 reset */
#define RCU_APB2RST_TIMER0RST           BIT(11)                         /*!< TIMER0 reset */
#define RCU_APB2RST_SPI0RST             BIT(12)                         /*!< SPI0 reset */
#define RCU_APB2RST_USART0RST           BIT(14)                         /*!< USART0 reset */

/* RCU_APB1RST */
#define RCU_APB1RST_TIMER1RST           BIT(0)                          /*!< TIMER1 reset */
#define RCU_APB1RST_TIMER2RST           BIT(1)                          /*!< TIMER2 reset */
#define RCU_APB1RST_TIMER3RST           BIT(2)                          /*!< TIMER3 reset */
#define RCU_APB1RST_TIMER4RST           BIT(3)                          /*!< TIMER4 reset */
#define RCU_APB1RST_TIMER5RST           BIT(4)                          /*!< TIMER5 reset */
#define RCU_APB1RST_TIMER6RST           BIT(5)                          /*!< TIMER6 reset */

#define RCU_APB1RST_WWDGTRST            BIT(11)                         /*!< WWDGT reset */
#define RCU_APB1RST_SPI1RST             BIT(14)                         /*!< SPI1 reset */
#define RCU_APB1RST_SPI2RST             BIT(15)                         /*!< SPI2 reset */
#define RCU_APB1RST_USART1RST           BIT(17)                         /*!< USART1 reset */
#define RCU_APB1RST_USART2RST           BIT(18)                         /*!< USART2 reset */
#define RCU_APB1RST_UART3RST            BIT(19)                         /*!< UART3 reset */
#define RCU_APB1RST_UART4RST            BIT(20)                         /*!< UART4 reset */
#define RCU_APB1RST_I2C0RST             BIT(21)                         /*!< I2C0 reset */
#define RCU_APB1RST_I2C1RST             BIT(22)                         /*!< I2C1 reset */
#define RCU_APB1RST_CAN0RST             BIT(25)                         /*!< CAN0 reset */
#define RCU_APB1RST_CAN1RST             BIT(26)                         /*!< CAN1 reset */
#define RCU_APB1RST_BKPIRST             BIT(27)                         /*!< backup interface reset */
#define RCU_APB1RST_PMURST              BIT(28)                         /*!< PMU reset */
#define RCU_APB1RST_DACRST              BIT(29)                         /*!< DAC reset */

